# Parameters
ch: 6
nc: 5  # number of classes

scales: 

   m: [0.67, 0.75, 768] 


backbone:
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1  # 1是rgb
  - [-2, 1, Multiin, [2]]  # 2

  - [-2, 1, Conv, [64, 3, 2]]  # 3-P1/2  rgb
  - [-2, 1, Conv, [64, 3, 2]]

  - [[-2, -1], 1, Concat_Novel_obb, [1, 96]]  # 5

  - [-2, 1, Conv, [96, 3, 2]]  # 6-P2/4  rgb
  - [-2, 1, Conv, [96, 3, 2]]

  - [-2, 3, C3k2, [128, False, 0.25]]  # 8  rgb
  - [-2, 3, C3k2, [128, False, 0.25]]  # 9

  - [[-2, -1], 1, Concat_Novel_obb, [1, 192]]  # 10

  - [-1, 1, Conv, [128, 3, 2]]  # 11-P3/8
  - [-3, 1, Conv, [128, 3, 2]]  # 12

  - [-2, 6, C3k2, [256, False, 0.25]]  # 13
  - [-2, 6, C3k2, [256, False, 0.25]]

  - [[-2, -1], 1, Concat_Novel_obb, [1, 384]]  # 15

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]  # 16-P4/16
  - [ -3, 1, Conv, [ 256, 3, 2 ] ]

  - [ -2, 6, C3k2, [ 256, True ] ]  # 18
  - [ -2, 6, C3k2, [ 256, True ] ]

  - [[-2, -1], 1, Concat_Novel_obb, [1, 384]]  # 20

  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  # 21-P5/32
  - [ -3, 1, Conv, [ 512, 3, 2 ] ]

  - [ -2, 3, C3k2, [ 512, True ] ]
  - [ -2, 3, C3k2, [ 512, True ] ]


  - [[-2, -1], 1, Concat_Novel_obb, [1, 768]]  # 25

  - [-1, 1, SPPF, [512, 5]]
  - [-1, 1, C2PSA, [512]] # 27


 # YOLO11 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 20], 1, Concat_Novel_obb, [1, 768]]  # cat backbone P4
  - [-1, 3, C3k2, [512, False]]  # 30

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 15], 1, Concat_Novel_obb, [1, 768]]  # cat backbone P3
  - [-1, 3, C3k2, [256, False]]  # 33 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 30], 1, Concat2, [1, 384]]  # cat head P4
  - [-1, 3, C3k2, [512, False]]  # 36 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 27], 1, Concat_Novel_obb, [1, 768]]  # cat head P5
  - [-1, 3, C3k2, [1024, True]]  # 39 (P5/32-large)

  - [[33, 36, 39], 1, OBB, [nc, 1]]  # Detect(P3, P4, P5)
